# Project 1, Part 1, Executive Questions: Sales Specific Questions

University of California, Berkeley
Master of Information and Data Science (MIDS) program
w205 - Fundamentals of Data Engineering

Student: Landon Morin

Year: 2023 anticipated

Semester: Spring

Section:

# Included Modules and Packages

Code cell containing your includes for modules and packages

In [1]:
import math
import numpy as np
import pandas as pd

import psycopg2

# Supporting code

Code cells containing any supporting code, such as connecting to the database, any functions, etc.  Remember you can use any code from the labs.

In [2]:
#
# function to run a select query and return rows in a pandas dataframe
# pandas puts all numeric values from postgres to float
# if it will fit in an integer, change it to integer
#

def my_select_query_pandas(query, rollback_before_flag, rollback_after_flag):
    "function to run a select query and return rows in a pandas dataframe"
    
    if rollback_before_flag:
        connection.rollback()
    
    df = pd.read_sql_query(query, connection)
    
    if rollback_after_flag:
        connection.rollback()
    
    # fix the float columns that really should be integers
    
    for column in df:
    
        if df[column].dtype == "float64":

            fraction_flag = False

            for value in df[column].values:
                
                if not np.isnan(value):
                    if value - math.floor(value) != 0:
                        fraction_flag = True

            if not fraction_flag:
                df[column] = df[column].astype('Int64')
    
    return(df)

In [3]:
connection = psycopg2.connect(
    user = "postgres",
    password = "ucb",
    host = "postgres",
    port = "5432",
    database = "postgres"
)

In [4]:
cursor = connection.cursor()

# Instructions for Specific Questions

For each specific quesion, you must write 1 and only 1 query that answers that specific question.  The results of your query must be displayed in a Pandas dataframe as demonstrated in the labs

All output should be sorted.

For store name, use the city name the store is located in.

When sorting by store name, sort in alphabetical order.

For month, use the full month name: January, February, March, etc.

When sorting by month, sort in calendar order: January, February, March, etc.  You may find it useful to include a month number to help with the sort.  It's ok to leave it in the output.

For day of week, use the full day of week name: Sunday, Monday, Tuesday, etc.

When sorting by day of week, sort in day of week order: Sunday, Monday, Tuesday, etc. You may find it usefule to include a day of week number to help with the sort.  It's ok to leave it in the output.

# 1.1.1 Total Sales as a Dollar Amount for all of AGM

In [ ]:
rollback_before_flag = True
rollback_after_flag = True

query = """

select sum(total_amount) as total_sales  
from sales

"""

my_select_query_pandas(query, rollback_before_flag, rollback_after_flag)

# 1.1.2 Total Sales as a Dollar Amount by Store

Sort by store name in alphabetical order

In [ ]:
rollback_before_flag = True
rollback_after_flag = True

query = """

select s.city as store,
       sum(total_amount) as total_sales
from stores as s 
     join sales as sa 
         on s.store_id = sa.store_id
group by store
order by store


"""

my_select_query_pandas(query, rollback_before_flag, rollback_after_flag)

# 1.1.3 Total Sales as a Dollar Amount by Month

Sort by month full name in calendar order

In [ ]:
rollback_before_flag = True
rollback_after_flag = True

query = """

select to_char(date_trunc('month', sale_date), 'Month') as month, 
       sum(total_amount) as monthly_sum 
from sales
group by date_trunc('month', sale_date), month
order by date_trunc('month', sale_date)



"""

my_select_query_pandas(query, rollback_before_flag, rollback_after_flag)

# 1.1.4 Total Sales as a Dollar Amount by Store and Month

Sort by store name in alphabetical order, then by month full name in calendar order

In [ ]:
rollback_before_flag = True
rollback_after_flag = True

query = """

select s.city as store,
       to_char(date_trunc('month', sale_date), 'Month') as month, 
       sum(total_amount) as monthly_sum
from stores as s 
     join sales as sa 
         on s.store_id = sa.store_id
group by store, date_trunc('month', sale_date), month
order by store, date_trunc('month', sale_date)



"""

my_select_query_pandas(query, rollback_before_flag, rollback_after_flag)

# 1.1.5 Total Sales as a Dollar Amount by Day of Week

Sort by day of week in day of week order.

In [ ]:
rollback_before_flag = True
rollback_after_flag = True

query = """

select to_char(date_trunc('day', sale_date), 'Day') as day_of_week, 
       sum(total_amount) as monthly_sum 
from sales
group by day_of_week, extract(dow from sale_date)
order by extract(dow from sale_date)



"""

my_select_query_pandas(query, rollback_before_flag, rollback_after_flag)

# 1.1.6 Total Sales as a Dollar Amount by Store and Day of Week

Sort by store name in alphabetical order, then by day of week in day of week order.

In [ ]:
rollback_before_flag = True
rollback_after_flag = True

query = """

select s.city as store,
       to_char(date_trunc('day', sale_date), 'Day') as day_of_week, 
       sum(total_amount) as monthly_sum
from stores as s 
     join sales as sa 
         on s.store_id = sa.store_id
group by store, day_of_week, extract(dow from sale_date)
order by store, extract(dow from sale_date)



"""

my_select_query_pandas(query, rollback_before_flag, rollback_after_flag)

# 1.1.7 Total Number of Sales for all of AGM

In [ ]:
rollback_before_flag = True
rollback_after_flag = True

query = """

select count()
from sales

"""

my_select_query_pandas(query, rollback_before_flag, rollback_after_flag)

# 1.1.8 Total Number of Sales by Store

Sort by store name in alphabetical order

In [ ]:
rollback_before_flag = True
rollback_after_flag = True

query = """

select count(distinct(sale_id, store_id)) as total_sales  
from sales

"""

my_select_query_pandas(query, rollback_before_flag, rollback_after_flag)

# 1.1.9 Average Dollar Amount per Sale

In [13]:
rollback_before_flag = True
rollback_after_flag = True

query = """

select avg(total_amount) as avg_revenue
from sales

"""

my_select_query_pandas(query, rollback_before_flag, rollback_after_flag)

   avg_revenue
0    64.215866

# 1.1.10 Average Dollar Amount per Sale by Store

Sort by store name in alphabetical order

In [17]:
rollback_before_flag = True
rollback_after_flag = True

query = """

select s.city as store,
       avg(total_amount) as avg_sale
from stores as s 
     join sales as sa 
         on s.store_id = sa.store_id
group by store
order by store


"""

my_select_query_pandas(query, rollback_before_flag, rollback_after_flag)

       store   avg_sale
0   Berkeley  64.146167
1     Dallas  64.240236
2      Miami  64.318707
3  Nashville  63.995732
4    Seattle  64.337642

# 1.1.11 The Executives have also asked you to provide your best example of a data visualization for one of the above queries

You may choose any one of the above queries. 

It's best to select the one that you think will provide the most interesting data visualization.  

You are allowed to add a pivot as demonstrated in the labs if it is needed for your data visualization.